#pragma once
#include "Shape.h"

namespace DXCore {
	class Plane :public Shape
	{
	public:
		UINT			m_iVertexType;
	public:
		//--------------------------------------------------------------------------------------
		// 정점 버퍼 생성
		//--------------------------------------------------------------------------------------
		bool			CreateVertexData() override;
		HRESULT			CreateVertexBuffer() override;
		//--------------------------------------------------------------------------------------
		// 인덱스 버퍼 생성
		//--------------------------------------------------------------------------------------
		bool			CreateIndexData() override;
		HRESULT			CreateIndexBuffer() override;
		//--------------------------------------------------------------------------------------
		// 텍스처 배열 초기화( 멀티텍스쳐용)
		//--------------------------------------------------------------------------------------
		bool			SetTextureArray();
	public:
		Plane();
		virtual ~Plane();
	};
}

